# ViewModelDisplayMode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewModelDisplayMode Property
ParameterTypeId Class See Also
---
"Display Model"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewModelDisplayMode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewModelDisplayMode As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewModelDisplayMode {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace